### pandas的数据结构 — series

In [2]:
import pandas as pd
obj=pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [4]:
obj2=pd.Series([4,7,-5,3],index=['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [5]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [6]:
obj2['a']

-5

In [7]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [8]:
# 如果数据被存放在一个Python字典中，也可以直接通过这个字典来创建Series：
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3=pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [9]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [10]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [11]:
obj3.index=['a','b','c','d']
obj3

a    35000
b    71000
c    16000
d     5000
dtype: int64

### DataFrame:

In [12]:
data={'a':[1,2,3],'b':[4,5,6]}
data

{'a': [1, 2, 3], 'b': [4, 5, 6]}

In [15]:
m=pd.DataFrame(data)
m

   a  b
0  1  4
1  2  5
2  3  6

In [16]:
m.a

0    1
1    2
2    3
Name: a, dtype: int64

In [17]:
type(m.b)

pandas.core.series.Series

In [20]:
m['b']

0    4
1    5
2    6
Name: b, dtype: int64

In [21]:
#行
m.loc[1]

a    2
b    5
Name: 1, dtype: int64

 题外话： 这几天投了几家公司的nlp/机器学习算法工程师，今天上午去面试了第一家新浪以后，也是本人第一次面试，感觉自己说的过于真诚。。。自己说出了自己的缺点。。（比如不是科班，所以能力不是太好，emmm，可能还是因为我实力不够，不够自信吧。。）然后最后觉得自己自学的东西还是太浅。
 面试官问了些问题：比如你懂LDA主题模型的原理和过程吗？你可以手推一下LR的梯度下降更新公式吗？（给我了一支笔和一张纸），你可以自己写出一个TensorFlow吗？可以说下lightGBM的原理吗？等等的。面试小姐姐最后还挺好的，给我了一些建议，说来面的其实都是科班的，他们的这些理论基础都很扎实什么的，让我回去一个一个算法的推公式，等等的。哎，所以我回来以后把剩下几家没面的都拒了，觉得还是好好学习，深入思考，不要浮躁，过段时间再实习吧。（果然自学转行 不是这么简单 面试需要扎实的基础 算法或是公式都要清楚 可能不会问太广 但是理论基础一定要好 而且对自己简历上的内容要能有逻辑的讲出来 最好提前准备一下 我就没准备。。。）没有准备好的时候 我装不出来我都懂的感觉。。。emmm 自信还是实力给的 就这样吧 之前本想过放弃 觉得职业生涯很迷茫和浮躁 想过去找另一个职业或者听爷爷奶奶的觉得女生就是考公务员 因此有点没动力继续学下去 现在觉得起码还有人给我面试机会哇 所以静下心再认真努力一次吧 / （and down了一天 什么都不想干什么作业都不想写系列 ）

In [4]:
import pandas as pd
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [5]:
index = obj.index
index[1:]

Index(['b', 'c'], dtype='object')

In [7]:
import numpy as np
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [8]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [9]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a','c'])
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [10]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [13]:
# 整数索引
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [15]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [17]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd','e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],index=['a', 'c', 'e', 'f', 'g'])
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [19]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],index=['a', 'b', 'c', 'd'], columns=['one', 'two'])
df
df.sum()

one    9.25
two   -5.80
dtype: float64

In [20]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [22]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [23]:
# 达到最小值或最大值的索引
df.idxmax()

one    b
two    d
dtype: object

In [24]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

#### 第六章 数据加载、存储与文件格式
今天状态太差了，但是我又不想被退出，不然我更不可能看完了，明天我再仔细过一遍。
啊~~~~ 控制自己思想的能力还是不行 emmm

In [33]:
df =pd.read_csv("D:\Courseware\Postgraduate\postgraduate4\datawhale\Python_for_DA\pydata-book-2nd-edition\examples\ex1.csv")

In [34]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [35]:
names = ['a', 'b', 'c', 'd', 'message']
pd.read_csv('D:\Courseware\Postgraduate\postgraduate4\datawhale\Python_for_DA\pydata-book-2nd-edition\examples/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [37]:
result = pd.read_table('D:\Courseware\Postgraduate\postgraduate4\datawhale\Python_for_DA\pydata-book-2nd-edition\examples/ex3.txt', sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [38]:
# na_values可以用一个列表或集合的字符串表示缺失值：
result = pd.read_csv('D:\Courseware\Postgraduate\postgraduate4\datawhale\Python_for_DA\pydata-book-2nd-edition\examples/ex5.csv', na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [39]:
pd.read_csv('D:\Courseware\Postgraduate\postgraduate4\datawhale\Python_for_DA\pydata-book-2nd-edition\examples/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [40]:
chunker = pd.read_csv('D:\Courseware\Postgraduate\postgraduate4\datawhale\Python_for_DA\pydata-book-2nd-edition\examples/ex6.csv', chunksize=1000)

In [41]:
data = pd.read_csv('D:\Courseware\Postgraduate\postgraduate4\datawhale\Python_for_DA\pydata-book-2nd-edition\examples/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [42]:
data.to_csv('D:\Courseware\Postgraduate\postgraduate4\datawhale\Python_for_DA\pydata-book-2nd-edition\examples/out.csv')

In [43]:
data2 = pd.read_csv('D:\Courseware\Postgraduate\postgraduate4\datawhale\Python_for_DA\pydata-book-2nd-edition\examples/out.csv')
data2

   Unnamed: 0 something  a   b     c   d message
0           0       one  1   2   3.0   4     NaN
1           1       two  5   6   NaN   8   world
2           2     three  9  10  11.0  12     foo

In [45]:
import csv
f = open('D:\Courseware\Postgraduate\postgraduate4\datawhale\Python_for_DA\pydata-book-2nd-edition\examples/ex7.csv')
reader = csv.reader(f)
for line in reader:
     print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [46]:
# json
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""
import json
result = json.loads(obj)
result

{'name': 'Wes',
 'pet': None,
 'places_lived': ['United States', 'Spain', 'Germany'],
 'siblings': [{'age': 30, 'name': 'Scott', 'pets': ['Zeus', 'Zuko']},
  {'age': 38, 'name': 'Katie', 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [47]:
asjson = json.dumps(result)
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [49]:
#pandas.read_json的默认选项假设JSON数组中的每个对象是表格中的一行：
data = pd.read_json('D:\Courseware\Postgraduate\postgraduate4\datawhale\Python_for_DA\pydata-book-2nd-edition\examples\example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [50]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [51]:
# XML和HTML：Web信息收集
tables = pd.read_html('D:\Courseware\Postgraduate\postgraduate4\datawhale\Python_for_DA\pydata-book-2nd-edition\examples/fdic_failed_bank_list.html')
len(tables)

1

In [52]:
failures = tables[0]
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [53]:
from lxml import objectify
path = 'D:\Courseware\Postgraduate\postgraduate4\datawhale\Python_for_DA\pydata-book-2nd-edition\datasets\mta_perf\Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()

In [54]:
data = []
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ','DESIRED_CHANGE', 'DECIMAL_PLACES']
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [55]:
perf = pd.DataFrame(data)
perf.head()

,AGENCY_NAME,CATEGORY,DESCRIPTION,FREQUENCY,INDICATOR_NAME,INDICATOR_UNIT,MONTHLY_ACTUAL,MONTHLY_TARGET,PERIOD_MONTH,PERIOD_YEAR,YTD_ACTUAL,YTD_TARGET
0,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,96.9,95,1,2008,96.9,95
1,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,95,95,2,2008,96,95
2,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,96.9,95,3,2008,96.3,95
3,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,98.3,95,4,2008,96.8,95
4,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,95.8,95,5,2008,96.6,95

In [56]:
xlsx = pd.ExcelFile('D:\Courseware\Postgraduate\postgraduate4\datawhale\Python_for_DA\pydata-book-2nd-edition\examples\/ex1.xlsx')
pd.read_excel(xlsx, 'Sheet1')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [57]:
# 数据库交互
import sqlite3
query = """ CREATE TABLE test (a VARCHAR(20), b VARCHAR(20), c REAL, d INTEGER );"""
con = sqlite3.connect('mydata.sqlite')
con.execute(query)

In [58]:
con.commit()
data = [('Atlanta', 'Georgia', 1.25, 6), ('Tallahassee', 'Florida', 2.6, 3),('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)

In [59]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [ ]:
# mysql
import mysql.connector
conn = mysql.connector.connect(user='root', password='root', database='yiibaidb',
default_authentication_plugin=mysql_native_password)
cursor = conn.cursor()
cursor.execute('select * from yiibaidb')
values = cursor.fetchall()
values